.codex/runtime/jmeter-baseline/report/statistics.json
{
  "GET /api/products/{id}" : {
    "transaction" : "GET /api/products/{id}",
    "sampleCount" : 3301,
    "errorCount" : 5,
    "errorPct" : 0.15146925,
    "meanResTime" : 55.989397152378075,
    "medianResTime" : 10.0,
    "minResTime" : 4.0,
    "maxResTime" : 30043.0,
    "pct1ResTime" : 15.0,
    "pct2ResTime" : 17.0,
    "pct3ResTime" : 23.0,
    "throughput" : 84.66924872393362,
    "receivedKBytesPerSec" : 44.11323706459845,
    "sentKBytesPerSec" : 12.320037167837997
  },
  "GET /api/products" : {
    "transaction" : "GET /api/products",
    "sampleCount" : 2663,
    "errorCount" : 5,
    "errorPct" : 0.18775816,
    "meanResTime" : 69.44911753661285,
    "medianResTime" : 12.0,
    "minResTime" : 5.0,
    "maxResTime" : 30018.0,
    "pct1ResTime" : 19.0,
    "pct2ResTime" : 22.0,
    "pct3ResTime" : 28.0,
    "throughput" : 68.30481955523636,
    "receivedKBytesPerSec" : 38.59093856606048,
    "sentKBytesPerSec" : 9.872180951342754
  },
  "GET /api/cart" : {
    "transaction" : "GET /api/cart",
    "sampleCount" : 43662,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3.145916357473322,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 40.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 4.0,
    "pct3ResTime" : 4.0,
    "throughput" : 1459.3889965906812,
    "receivedKBytesPerSec" : 306.45143600842306,
    "sentKBytesPerSec" : 263.6591448918711
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 49626,
    "errorCount" : 10,
    "errorPct" : 0.020150727,
    "meanResTime" : 10.218857050739496,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 30043.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 4.0,
    "pct3ResTime" : 4.0,
    "throughput" : 1272.8858337394515,
    "receivedKBytesPerSec" : 317.8701043376638,
    "sentKBytesPerSec" : 224.5200273087824
  }
}