.codex/runtime/jmeter-seckill-2/report/statistics.json
{
  "POST /api/seckill/orders" : {
    "transaction" : "POST /api/seckill/orders",
    "sampleCount" : 20,
    "errorCount" : 15,
    "errorPct" : 75.0,
    "meanResTime" : 28.900000000000002,
    "medianResTime" : 27.5,
    "minResTime" : 19.0,
    "maxResTime" : 45.0,
    "pct1ResTime" : 44.00000000000002,
    "pct2ResTime" : 45.0,
    "pct3ResTime" : 45.0,
    "throughput" : 22.3463687150838,
    "receivedKBytesPerSec" : 6.13215782122905,
    "sentKBytesPerSec" : 7.856145251396648
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 20,
    "errorCount" : 15,
    "errorPct" : 75.0,
    "meanResTime" : 28.900000000000002,
    "medianResTime" : 27.5,
    "minResTime" : 19.0,
    "maxResTime" : 45.0,
    "pct1ResTime" : 44.00000000000002,
    "pct2ResTime" : 45.0,
    "pct3ResTime" : 45.0,
    "throughput" : 22.3463687150838,
    "receivedKBytesPerSec" : 6.13215782122905,
    "sentKBytesPerSec" : 7.856145251396648
  }
}